{
    "encoder": {
        "name": "encoder",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        200
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "encoder_input"
                },
                "name": "encoder_input",
                "inbound_nodes": []
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 100,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "truncated_normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": null,
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense",
                "inbound_nodes": [
                    [
                        [
                            "encoder_input",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        2
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "encoder_labels"
                },
                "name": "encoder_labels",
                "inbound_nodes": []
            },
            {
                "class_name": "LayerNormalization",
                "config": {
                    "name": "layer_normalization",
                    "trainable": false,
                    "dtype": "float32",
                    "axis": [
                        1
                    ],
                    "epsilon": 0.001,
                    "center": false,
                    "scale": false,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "layer_normalization",
                "inbound_nodes": [
                    [
                        [
                            "dense",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_1",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 100,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_initializer": null,
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense_1",
                "inbound_nodes": [
                    [
                        [
                            "encoder_labels",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add",
                "config": {
                    "name": "add",
                    "trainable": true,
                    "dtype": "float32"
                },
                "name": "add",
                "inbound_nodes": [
                    [
                        [
                            "layer_normalization",
                            0,
                            0,
                            {}
                        ],
                        [
                            "dense_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "TensorFlowOpLayer",
                "config": {
                    "name": "Relu",
                    "trainable": true,
                    "dtype": "float32",
                    "node_def": {
                        "name": "Relu",
                        "op": "Relu",
                        "input": [
                            "add/Identity"
                        ],
                        "attr": {
                            "T": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    "constants": {}
                },
                "name": "tf_op_layer_Relu",
                "inbound_nodes": [
                    [
                        [
                            "add",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.5,
                    "noise_shape": null,
                    "seed": null
                },
                "name": "dropout",
                "inbound_nodes": [
                    [
                        [
                            "tf_op_layer_Relu",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_2",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 40,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "truncated_normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": null,
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense_2",
                "inbound_nodes": [
                    [
                        [
                            "dropout",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "LayerNormalization",
                "config": {
                    "name": "layer_normalization_1",
                    "trainable": false,
                    "dtype": "float32",
                    "axis": [
                        1
                    ],
                    "epsilon": 0.001,
                    "center": false,
                    "scale": false,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "layer_normalization_1",
                "inbound_nodes": [
                    [
                        [
                            "dense_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_3",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 40,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_initializer": null,
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense_3",
                "inbound_nodes": [
                    [
                        [
                            "encoder_labels",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add",
                "config": {
                    "name": "add_1",
                    "trainable": true,
                    "dtype": "float32"
                },
                "name": "add_1",
                "inbound_nodes": [
                    [
                        [
                            "layer_normalization_1",
                            0,
                            0,
                            {}
                        ],
                        [
                            "dense_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "TensorFlowOpLayer",
                "config": {
                    "name": "Relu_1",
                    "trainable": true,
                    "dtype": "float32",
                    "node_def": {
                        "name": "Relu_1",
                        "op": "Relu",
                        "input": [
                            "add_1/Identity"
                        ],
                        "attr": {
                            "T": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    "constants": {}
                },
                "name": "tf_op_layer_Relu_1",
                "inbound_nodes": [
                    [
                        [
                            "add_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_1",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.5,
                    "noise_shape": null,
                    "seed": null
                },
                "name": "dropout_1",
                "inbound_nodes": [
                    [
                        [
                            "tf_op_layer_Relu_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "latent",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 20,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "truncated_normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "latent",
                "inbound_nodes": [
                    [
                        [
                            "dropout_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "sigma_enc",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 20,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "truncated_normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Constant",
                        "config": {
                            "value": -10
                        }
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "sigma_enc",
                "inbound_nodes": [
                    [
                        [
                            "dropout_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            }
        ],
        "input_layers": {
            "encoder_input": [
                "encoder_input",
                0,
                0
            ],
            "encoder_labels": [
                "encoder_labels",
                0,
                0
            ]
        },
        "output_layers": [
            [
                "latent",
                0,
                0
            ],
            [
                "sigma_enc",
                0,
                0
            ]
        ]
    },
    "decoder": {
        "name": "decoder",
        "layers": [
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        20
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "decoder_input"
                },
                "name": "decoder_input",
                "inbound_nodes": []
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 40,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "truncated_normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": null,
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense",
                "inbound_nodes": [
                    [
                        [
                            "decoder_input",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "InputLayer",
                "config": {
                    "batch_input_shape": [
                        null,
                        2
                    ],
                    "dtype": "float32",
                    "sparse": false,
                    "ragged": false,
                    "name": "decoder_labels"
                },
                "name": "decoder_labels",
                "inbound_nodes": []
            },
            {
                "class_name": "LayerNormalization",
                "config": {
                    "name": "layer_normalization",
                    "trainable": false,
                    "dtype": "float32",
                    "axis": [
                        1
                    ],
                    "epsilon": 0.001,
                    "center": false,
                    "scale": false,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "layer_normalization",
                "inbound_nodes": [
                    [
                        [
                            "dense",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_1",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 40,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_initializer": null,
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense_1",
                "inbound_nodes": [
                    [
                        [
                            "decoder_labels",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add",
                "config": {
                    "name": "add",
                    "trainable": true,
                    "dtype": "float32"
                },
                "name": "add",
                "inbound_nodes": [
                    [
                        [
                            "layer_normalization",
                            0,
                            0,
                            {}
                        ],
                        [
                            "dense_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "TensorFlowOpLayer",
                "config": {
                    "name": "Relu",
                    "trainable": true,
                    "dtype": "float32",
                    "node_def": {
                        "name": "Relu",
                        "op": "Relu",
                        "input": [
                            "add/Identity"
                        ],
                        "attr": {
                            "T": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    "constants": {}
                },
                "name": "tf_op_layer_Relu",
                "inbound_nodes": [
                    [
                        [
                            "add",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.5,
                    "noise_shape": null,
                    "seed": null
                },
                "name": "dropout",
                "inbound_nodes": [
                    [
                        [
                            "tf_op_layer_Relu",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_2",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 100,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "truncated_normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": null,
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense_2",
                "inbound_nodes": [
                    [
                        [
                            "dropout",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "LayerNormalization",
                "config": {
                    "name": "layer_normalization_1",
                    "trainable": false,
                    "dtype": "float32",
                    "axis": [
                        1
                    ],
                    "epsilon": 0.001,
                    "center": false,
                    "scale": false,
                    "beta_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "gamma_initializer": {
                        "class_name": "Ones",
                        "config": {}
                    },
                    "beta_regularizer": null,
                    "gamma_regularizer": null,
                    "beta_constraint": null,
                    "gamma_constraint": null
                },
                "name": "layer_normalization_1",
                "inbound_nodes": [
                    [
                        [
                            "dense_2",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_3",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 100,
                    "activation": "linear",
                    "use_bias": false,
                    "kernel_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "bias_initializer": null,
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense_3",
                "inbound_nodes": [
                    [
                        [
                            "decoder_labels",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Add",
                "config": {
                    "name": "add_1",
                    "trainable": true,
                    "dtype": "float32"
                },
                "name": "add_1",
                "inbound_nodes": [
                    [
                        [
                            "layer_normalization_1",
                            0,
                            0,
                            {}
                        ],
                        [
                            "dense_3",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "TensorFlowOpLayer",
                "config": {
                    "name": "Relu_1",
                    "trainable": true,
                    "dtype": "float32",
                    "node_def": {
                        "name": "Relu_1",
                        "op": "Relu",
                        "input": [
                            "add_1/Identity"
                        ],
                        "attr": {
                            "T": {
                                "type": "DT_FLOAT"
                            }
                        }
                    },
                    "constants": {}
                },
                "name": "tf_op_layer_Relu_1",
                "inbound_nodes": [
                    [
                        [
                            "add_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dropout",
                "config": {
                    "name": "dropout_1",
                    "trainable": true,
                    "dtype": "float32",
                    "rate": 0.5,
                    "noise_shape": null,
                    "seed": null
                },
                "name": "dropout_1",
                "inbound_nodes": [
                    [
                        [
                            "tf_op_layer_Relu_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_4",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 200,
                    "activation": "linear",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "truncated_normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense_4",
                "inbound_nodes": [
                    [
                        [
                            "dropout_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            },
            {
                "class_name": "Dense",
                "config": {
                    "name": "dense_5",
                    "trainable": true,
                    "dtype": "float32",
                    "units": 200,
                    "activation": "sigmoid",
                    "use_bias": true,
                    "kernel_initializer": {
                        "class_name": "VarianceScaling",
                        "config": {
                            "scale": 2.0,
                            "mode": "fan_in",
                            "distribution": "truncated_normal",
                            "seed": null
                        }
                    },
                    "bias_initializer": {
                        "class_name": "Zeros",
                        "config": {}
                    },
                    "kernel_regularizer": null,
                    "bias_regularizer": null,
                    "activity_regularizer": null,
                    "kernel_constraint": null,
                    "bias_constraint": null
                },
                "name": "dense_5",
                "inbound_nodes": [
                    [
                        [
                            "dropout_1",
                            0,
                            0,
                            {}
                        ]
                    ]
                ]
            }
        ],
        "input_layers": {
            "decoder_input": [
                "decoder_input",
                0,
                0
            ],
            "decoder_labels": [
                "decoder_labels",
                0,
                0
            ]
        },
        "output_layers": [
            [
                "dense_4",
                0,
                0
            ],
            [
                "dense_5",
                0,
                0
            ]
        ]
    }
}
